"CIAdditionCompositing" = "Lisää värikomponentteja kirkkaustehosteen aikaansaamiseksi. Tätä suodinta käytetään yleensä korostusten tai linssiheijastumatehosteiden lisäämiseen.";"CIAffineClamp" = "Suorittaa affiinimuunnoksen lähdekuvalle ja laajentaa muunnetun kuvan reunoilla olevia pikseleitä ulospäin. Tämä suodin toimii samoin kuin CIAffineTransform-suodin, mutta tuottaa laajuudeltaan äärettömän kuvan. Tätä suodinta voidaan käyttää kuvan sumentamiseen, kun halutaan välttää pehmeää mustaa reunusta kuvan reunoilla.";"CIAffineTile" = "Suorittaa affiinimuunnoksen kuvalle ja jakaa muunnetun kuvan ruutuihin.";"CIAffineTransform" = "Suorittaa affiinimuunnoksen kuvalle. Voit skaalata, kääntää tai pyörittää syötekuvaa. Voit myös suorittaa näiden toimintojen yhdistelmän.";"CIBarsSwipeTransition" = "Muuntaa yhden kuvan toiseksi poistamalla nelikulmaisia osia etualalla olevasta kuvasta kohdekuvan paljastamiseksi.";"CIBlendWithMask" = "Interpoloi kuvan ja taustan välillä harmaasävymaskin arvoja käyttäen. Kun maskin arvo on 0,0, tuloksena on tausta. Kun maskin arvo on 1,0, tuloksena on kuva.";"CIBloom" = "Pehmentää reunoja ja lisää miellyttävän hehkun kuvaan.";"CIBoxBlur" = "Pehmentää tai terävöittää kuvaa laatikonmuotoista konvoluutioydintä käyttäen.";"CIBumpDistortion" = "Luo kuperan tai koveran kuplan, joka sijaitsee määrätyssä kohdassa kuvaa.";"CIBumpDistortionLinear" = "Luo kuplan, joka sijaitsee kuvan lineaarisessa osassa.";"CICMYKHalftone" = "Luo värillisen rasteriversion lähdekuvasta käyttäen syaania, magentaa, keltaista ja mustaa väriä valkoisella taustalla.";"CICheckerboardGenerator" = "Luo shakkilautakuvion. Voit määritellä shakkilaudan koon ja värit sekä kuvion terävyyden.";"CICircleSplashDistortion" = "Vääristää ympyrän kehän ulkopuolella olevia pikseleitä.";"CICircularScreen" = "Simuloi ympyränmuotoista rasterinäyttöä.";"CICircularWrap" = "Käärii kuvan läpinäkyvän ympyrän ympärille. Kuvan vääristymä on suoraan verrannollinen etäisyyteen ympyrän keskipisteestä.";"CIColorControls" = "Säädä kylläisyys-, kirkkaus- ja kontrastiarvoja.";"CIColorCube" = "Käyttää kolmiulotteista väritaulukkoa lähdekuvan pikseleiden muuntamiseen. Väritaulukon on koostuttava ennaltakerrottua alfaa käyttävistä liukuluku-RGBA-soluista. Datan sarakkeet on indeksoitu punaisella ja rivit vihreällä. Datan toisiaan seuraavat tasot on indeksoitu sinisellä.";"CIColorInvert" = "Kääntää kuvan värit.";"CIColorMap" = "Suorittaa lähdeväriarvoille epälineaarisen muunnoksen taulukon kuvausarvoja käyttäen.";"CIColorMatrix" = "Kertoo lähdeväriarvot ja lisää poikkeamakertoimen jokaiseen värikomponenttiin.";"CIColorMonochrome" = "Kuvaa värit uudelleen niin, että ne mahtuvat yhden värin sävyihin.";"CIColorPosterize" = "Kuvaa uudelleen punaisen, vihreän ja sinisen värikomponentin niille määriteltyyn kirkkausarvojen määrään. Tämä suodin himmentää värejä luoden samankaltaisen vaikutelman kuin silkkipainetussa julisteessa.";"CIComicEffect" = "Simuloi sarjakuvapiirrosta rajaamalla ääriviivat ja käyttämällä rasteriväritehostetta.";"CIConstantColorGenerator" = "Luo tasaisen värin. Tämän suotimen tulostetta käytetään yleensä toisen suotimen syötteenä.";"CICopyMachineTransition" = "Siirtyy yhdestä kuvasta toiseen simuloimalla kopiokoneen toimintaa.";"CICrop" = "Rajaa kuvan. Rajatun kuvan koko ja muoto riippuvat määriteltävästä nelikulmiosta.";"CICrystallize" = "Luo monikulmaisia värikuvioita yhdistämällä lähteen pikseliväriarvoja.";"CIDiscBlur" = "Pehmentää tai terävöittää kuvaa ympyränmuotoista konvoluutioydintä käyttäen.";"CIDisintegrateWithMaskTransition" = "Siirtyy yhdestä kuvasta toiseen käyttäen maskin määrittelemää kuviota.";"CIDisplacementDistortion" = "Käyttää toisen kuvan harmaasävyarvoja ensimmäisessä kuvassa. Harmaasävyarvot määrittelevät tulostekuvan pintakuvion.";"CIDissolveTransition" = "Käyttää ristikuvaa yhdestä kuvasta toiseen siirtymiseen.";"CIDotScreen" = "Simuloi rasterinäytön pistekuvioita.";"CIEdges" = "Etsii kuvan reunat ja näyttää ne värillisinä.";"CIEdgeWork" = "Tuottaa kuvasta tyylitellyn mustavalkoversion, joka näyttää samankaltaiselta kuin puukaiverrus.";"CIEightfoldReflectedTile" = "Tuottaa lähdekuvasta tiilikuvan käyttämällä 8-suuntaista heijastettua symmetriaa.";"CIExposureAdjust" = "Säätää kuvan valotusasetusta samankaltaisesti kuin valotusta säädetään kamerassa aukkolukua muuttamalla.";"CIFalseColor" = "Kuvaa luminanssin kahden värin väriliukuun. Väärillä väreillä käsitellään usein tähtitieteellistä tai muuta tieteellistä dataa, kuten ultravioletti- tai röntgenkuvia.";"CIFastBoxBlur" = "Pehmentää tai terävöittää kuvaa laatikonmuotoista konvoluutioydintä käyttäen.";"CIFastDiscBlur" = "Pehmentää tai terävöittää kuvaa ympyränmuotoista konvoluutioydintä käyttäen.";"CIFlashTransition" = "Siirtyy yhdestä kuvasta toiseen luomalla salamavalon. Salama sijaitsee määritellyssä kohdassa. Salama on aluksi pieni, mutta laajenee nopeasti täyttäen koko kuvakehyksen salaman värillä. Kun väri häipyy, kohdekuva tulee näkyviin.";"CIFourfoldReflectedTile" = "Tuottaa lähdekuvasta tiilikuvan käyttämällä 4-suuntaista heijastettua symmetriaa.";"CIFourfoldRotatedTile" = "Tuottaa lähdekuvasta tiilikuvan pyörittämällä lähdettä 90 asteen askelin.";"CIFourfoldTranslatedTile" = "Tuottaa lähdekuvasta tiilikuvan käyttämällä neljää kääntötoimintoa.";"CIGammaAdjust" = "Säätää keskisävyjen kirkkautta. Tätä suodinta käytetään yleensä näyttöjen epälineaaristen tehosteiden kompensointiin. Gamman säätäminen muuttaa mustan ja valkoisen välillä siirtymisen jyrkkyyttä.";"CIGaussianBlur" = "Levittää lähdepikseleitä normaalijakauman määrittelemän määrän.";"CIGaussianGradient" = "Luo väriliu'un, joka muuttuu väristä toiseen normaalijakaumaa käyttäen.";"CIGlassDistortion" = "Vääristää kuvaa käyttämällä lasinkaltaista pintakuviota. Tulostekuvan kohollaan olevat osat ovat pintakuviokartan käyttämisen tulosta.";"CIGlassLozenge" = "Luo vinoneliönmuotoisen linssin ja vääristää kuvan kohdasta, jonka päälle linssi sijoitetaan.";"CIGlideReflectedTile" = "Tuottaa tiilikuvan kääntämällä ja suttaamalla lähdekuvan.";"CIGloom" = "Himmentää kuvan kirkkaita kohtia.";"CIHatchedScreen" = "Simuloi rasterinäytön raitakuvioita.";"CIHeightFieldFromMask" = "Tuottaa harmaasävymaskista jatkuvan kolmiulotteisen, loft-muotoisen korkeuskentän. Maskin valkoiset arvot määrittelevät pikselit, jotka ovat korkeuskentän sisäpuolella, ja mustat arvot määrittelevät pikselit, jotka ovat ulkopuolella. Kenttä vaihtuu pehmeästi ja jatkuvasti maskin sisällä ja saavuttaa arvon 0 maskin reunalla. Tätä suodinta voidaan käyttää yhdessä CIShadedMaterial-suotimen kanssa erittäin realististen varjostettujen objektien tuottamiseen.";"CIHexagonalPixellate" = "Näyttää kuvan värillisinä kuusikulmioina, joiden väri on niiden korvaamien pikseleiden keskiarvo.";"CIHoleDistortion" = "Luo ympyränmuotoisen alueen, joka työntää kuvan pikseleitä ulospäin vääristäen ympyrää lähinnä olevia pikseleitä eniten.";"CIHueAdjust" = "Muuttaa lähdepikselien yleistä värisävyä.";"CIKaleidoscope" = "Tuottaa lähdekuvasta kaleidoskooppisen kuvan käyttämällä 12-suuntaista symmetriaa.";"CILanczosScaleTransform" = "Tuottaa korkealaatuisen skaalatun version lähdekuvasta. Tätä suodinta käytetään yleensä kuvan pienentämiseen.";"CILenticularHaloGenerator" = "Simuloi sädekehää, joka syntyy linssin laajenemisesta johtuvasta valon taipumisesta. Tällä suotimella simuloidaan yleensä linssikajoa tai muita samankaltaisia tehosteita.";"CILineOverlay" = "Luo luonnoksen, joka korostaa kuvan reunat mustalla ja jättää ei-korostetut osat läpinäkyviksi. Lopputuloksessa on alfa ja se näytetään mustana, joten se ei näytä kummoiselta ennen kuin se näytetään toisen kuvan päällä kompositointia käyttäen.";"CILineScreen" = "Simuloi rasterinäytön viivakuvioita.";"CILinearGradient" = "Luo väriliu'un, joka vaihtuu kahden määritellyn päätepisteen välillä pitkittäisen akselin suuntaisesti.";"CIMaskToAlpha" = "Muuntaa harmaasävykuvan valkoiseksi kuvaksi, joka on maskattu alfalla. Lähdekuvan valkoiset arvot tuottavat maskin sisäpuolen; mustista arvoista tulee täysin läpinäkyviä.";"CIMaximumCompositing" = "Laskee kahden syötekuvan värikomponenttien maksimiarvot ja luo tulostekuvan maksimiarvoja käyttäen. Tämä on varjostuksen kaltaista.";"CIMedianFilter" = "Laskee lähekkäisten pikselien mediaaniarvon ja korvaa pikselien arvot mediaanilla. Tämä vähentää kohinaa.";"CIMinimumCompositing" = "Laskee kahden syötekuvan värikomponenttien minimiarvot ja luo tulostekuvan minimiarvoja käyttäen. Tämä on lisävalotuksen kaltaista.";"CIModTransition" = "Siirtyy yhdestä kuvasta toiseen näyttämällä kohdekuvan epäsäännöllisen muotoisten reikien läpi.";"CIMotionBlur" = "Sumentaa kuvan simuloimalla kameraa, joka liikkuu määrätyn etäisyyden määrätyssä kulmassa kuvaamisen aikana.";"CIMultiplyCompositing" = "Kertoo kahden syötekuvan värikomponentit ja luo tulostekuvan kerrottuja arvoja käyttäen. Tätä suodinta käytetään yleensä kohdevalon tai vastaavan valotehosteen lisäämiseen kuvaan.";"CINoiseReduction" = "Vähentää kohinaa käyttämällä kynnysarvoa, joka määrittelee sen, mitä pidetään kohinana. Arvoa pienempiä muutoksia luminanssissa pidetään kohinana ja niiden kohinaa vähennetään paikallisella sumennuksella. Arvoa suurempia muutoksia pidetään reunoina ja niitä terävöitetään.";"CIOpTile" = "Jakaa kuvan osiin, suorittaa määritellyn skaalauksen ja pyörityksen ja kokoaa kuvan uudelleen luoden op-taiteen tyyppisen vaikutelman.";"CIPageCurlTransition" = "Siirtyy yhdestä kuvasta toiseen simuloimalla kääntyvää sivua näyttäen uuden kuvan, kun sivu kääntyy.";"CIParallelogramTile" = "Vääristää kuvan heijastamalla sen suunnikkaaseen ja tekee tuloksesta tiilikuvion.";"CIPerspectiveTile" = "Suorittaa perspektiivimuunnoksen kuvalle ja tekee tuloksesta tiilikuvion.";"CIPerspectiveTransform" = "Simuloi katselupaikan muutosta muuttamalla kuvan geometriaa. Perspektiivisuodinta voidaan käyttää kuvan kallistamiseen.";"CIPinchDistortion" = "Luo suorakaiteenmuotoisen alueen, joka painaa lähdepikseleitä sisäänpäin vääristäen suorakaidetta lähinnä olevia pikseleitä eniten.";"CIPixellate" = "Tekee kuvasta rakeisen.";"CIPointillize" = "Näyttää lähdekuvan pointillistiseen tyyliin.";"CIRadialGradient" = "Luo väriliu'un, joka vaihtuu sädettäisesti kahden samankeskisen ympyrän välillä. Toisen ympyrän säde voi olla 0.";"CIRandomGenerator" = "Luo äärettömän laajan kuvan, jonka pikseliarvot koostuvat neljästä itsenäisestä, tasaisesti jakautuneesta satunnaisluvusta väliltä 0 - 1.";"CIRippleTransition" = "Siirtyy yhdestä kuvasta toiseen luomalla ympyränmuotoisen aallon, joka laajenee keskipisteestä paljastaen uuden kuvan aallon vanavedessä.";"CISepiaTone" = "Kuvaa kuvan värit ruskean eri sävyihin.";"CIShadedMaterial" = "Tuottaa varjostetun kuvan korkeuskentästä. Korkeuskenttä on määritelty sisältämään suurempia korkeuksia vaaleammille sävyille ja pienempiä korkeuksia (matalammat alueet) tummemmille sävyille. Yhdistämällä tämä suodin CIHeightFieldFromMask-suotimen kanssa voidaan nopeasti tuottaa varjostuksia maskeihin, kuten tekstiin.";"CISharpenLuminance" = "Lisää kuvan yksityiskohtia terävöittämällä. Toiminto käyttää kuvan luminanssia; sillä ei ole vaikutusta pikselien krominanssiin.";"CISixfoldReflectedTile" = "Tuottaa lähdekuvasta tiilikuvan käyttämällä 6-suuntaista heijastettua symmetriaa.";"CISixfoldRotatedTile" = "Tuottaa lähdekuvasta tiilikuvan pyörittämällä lähdettä 60 asteen askelin.";"CISourceAtopCompositing" = "Sijoittaa lähdekuvan taustakuvan päälle ja määrittelee taustakuvan luminanssilla, mitä näytetään. Yhdistelmä näyttää taustakuvan ja lähdekuvan ne kohdat, jotka ovat taustan näkyvien kohtien päällä.";"CISourceInCompositing" = "Käyttää toista kuvaa määrittelemään, mitä jätetään kohdekuvaan, käytännössä rajaten kuvan.";"CISourceOutCompositing" = "Käyttää toista kuvaa määrittelemään, mitä ensimmäisestä kuvasta poistetaan.";"CISourceOverCompositing" = "Sijoittaa toisen kuvan ensimmäisen päälle.";"CISpotColor" = "Korvaa yhden tai useamman värialueen spottiväreillä.";"CISpotLight" = "Käyttää kuvassa suunnattua kohdevalotehostetta.";"CIStarShineGenerator" = "Luo tähtisadekuvion. Tulostekuvaa käytetään yleensä toisen suotimen syötteenä.";"CIStripesGenerator" = "Luo juovakuvion. Voit säätää juovien väriä, väliä ja kontrastia.";"CISunbeamsGenerator" = "Luo aurinkotehosteen. Auringonsädesuotimen tulostetta käytetään yleensä yhdistelmäsuotimen syötteenä.";"CISwipeTransition" = "Siirtyy kuvasta toiseen simuloimalla pyyhkäisevää liikettä.";"CITorusLensDistortion" = "Luo renkaanmuotoisen linssin ja vääristää kuvan kohdasta, jonka päälle linssi sijoitetaan.";"CITriangleTile" = "Kuvaa kolmikulmaisen osan kuvasta kolmikulmaiseen alueeseen ja tekee tuloksesta tiilikuvion.";"CITwelvefoldReflectedTile" = "Tuottaa lähdekuvasta tiilikuvan käyttämällä 12-suuntaista heijastettua symmetriaa.";"CITwirlDistortion" = "Luo pyörähdystehosteen pyörittämällä pisteen ympärillä olevia pikseleitä. Voit määritellä kierrosten määrän sekä tehosteen keskipisteen ja säteen.";"CIUnsharpMask" = "Lisää kontrastia kuvan eriväristen pikseleiden välisillä reunoilla.";"CIVortexDistortion" = "Simuloi pyörrettä pyörittämällä pisteen ympärillä olevia pikseleitä. Voit määritellä kierrosten määrän sekä tehosteen keskipisteen ja säteen. ";"CIWhitePointAdjust" = "Säätää kuvan viitteenä olevaa valkoista pistettä ja kuvaa lähteen kaikki värit uutta viitettä käyttäen.";"CIZoomBlur" = "Simuloi kameralla zoomaamista kuvattaessa.";"CIColorBlendMode" = "Käyttää taustan luminanssiarvoja lähdekuvan värisävy- ja kylläisyysarvojen kanssa. Tämä tila säilyttää kuvan harmaatasot.";"CIColorBurnBlendMode" = "Tummentaa taustakuvanäytteitä heijastamaan lähdekuvanäytteitä. Valkoista merkitsevät lähdekuvanäytteiden arvot eivät saa aikaan muutosta.";"CIColorDodgeBlendMode" = "Kirkastaa taustakuvanäytteitä heijastamaan lähdekuvanäytteitä. Mustaa merkitsevät lähdekuvanäytteiden arvot eivät saa aikaan muutosta.";"CIDarkenBlendMode" = "Luo yhdistettyjä kuvanäytteitä valitsemalla tummemmat näytteet (joko lähdekuvasta tai taustasta). Taustakuvanäytteet korvataan tummemmilla lähdekuvanäytteillä, jos sellaisia on. Muussa tapauksessa taustakuvanäytteet jätetään ennalleen.";"CIDifferenceBlendMode" = "Vähentää joko lähdekuvan näytevärin taustakuvan näyteväristä tai päinvastoin riippuen siitä kumman näytteen kirkkausarvo on suurempi. Lähdekuvan mustat väriarvot eivät saa aikaan muutosta; valkoinen kääntää taustaväriarvot.";"CIExclusionBlendMode" = "Tuottaa samankaltaisen tehosteen kuin CIDifferenceBlendMode-suodin, mutta vähemmällä kontrastilla. Lähdekuvan mustat näytearvot eivät saa aikaan muutosta; valkoinen kääntää taustaväriarvot.";"CIHardLightBlendMode" = "Kertoo tai rasteroi värejä lähdekuvan näytevärin mukaan. Jos lähdekuvan näyteväri on vaaleampi kuin 50 % harmaa, taustaa vaalennetaan kuten rasteroinnissa. Jos lähdekuvan näyteväri on tummempi kuin 50 % harmaa, taustaa tummennetaan kuten kertomisessa. Jos lähdekuvan näyteväri on 50 % harmaa, lähdekuvaa ei muuteta. Täysin mustat tai valkoiset kuvanäytteet saavat aikaan täysin mustan tai valkoisen lopputuloksen. Kokonaisvaikutelma on samankaltainen kuin kirkkaan kohdevalon osoittamisessa lähdekuvaan.";"CIHueBlendMode" = "Käyttää taustan luminanssi- ja kylläisyysarvoja lähdekuvan värisävyn kanssa.";"CILightenBlendMode" = "Luo yhdistettyjä kuvanäytteitä valitsemalla vaaleammat näytteet (joko lähdekuvasta tai taustasta). Taustakuvanäytteet korvataan vaaleammilla lähdekuvanäytteillä, jos sellaisia on. Muussa tapauksessa taustakuvanäytteet jätetään ennalleen.";"CILuminosityBlendMode" = "Käyttää taustan värisävyä ja kylläisyyttä lähdekuvan luminanssin kanssa. Tämä tila luo tehosteen, joka on käänteinen CIColorBlendMode-suotimeen nähden.";"CIMultiplyBlendMode" = "Kertoo lähdekuvanäytteet taustakuvanäytteillä. Tuloksena on värit, jotka ovat vähintään niin tummia kuin toinen kahdesta näyteväristä.";"CIOverlayBlendMode" = "Kertoo tai rasteroi lähdekuvanäytteitä taustakuvanäytteiden kanssa taustaväristä riippuen. Tuloksessa kuvanäytteet näytetään päällekkäin taustan korostukset ja varjot säilyttäen. Taustaväri sekoittuu lähdekuvaan taustan vaaleutta tai tummuutta heijastaen.";"CISaturationBlendMode" = "Käyttää taustan luminanssi- ja värisävyarvoja lähdekuvan kylläisyyden kanssa. Taustan alueet, joilla ei ole kylläisyyttä (siis puhtaan harmaat alueet), eivät saa aikaan muutosta.";"CIScreenBlendMode" = "Kertoo käänteiset lähdekuvanäytteet käänteisillä taustakuvanäytteillä. Tuloksena on värit, jotka ovat vähintään niin vaaleita kuin toinen kahdesta näyteväristä.";"CISoftLightBlendMode" = "Tummentaa tai vaalentaa värejä lähdekuvan näytevärin mukaan. Jos lähdekuvan näyteväri on vaaleampi kuin 50 % harmaa, taustaa vaalennetaan kuten varjostuksessa. Jos lähdekuvan näyteväri on tummempi kuin 50 % harmaa, taustaa tummennetaan kuten lisävalotuksessa. Jos lähdekuvan näyteväri on 50 % harmaa, taustaa ei muuteta. Täysin mustat tai valkoiset kuvanäytteet tummentavat tai vaalentavat alueita, mutta eivät saa aikaan täysin mustaa tai valkoista lopputulosta. Kokonaisvaikutelma on samankaltainen kuin himmeän kohdevalon osoittamisessa lähdekuvaan.";"outputImage" = "Suotimen tuottama kuva.";"inputBackgroundImage" = "Taustakuvana käytettävä kuva.";"inputImage" = "Syötekuvana käytettävä kuva. Myös taustakuvaa käyttäville suotimille tämä on etualalla oleva kuva.";"inputTime" = "Tehosteen kesto.";"inputTransform" = "Käytettävä muunnos.";"inputScale" = "Tehosteen määrä.";"inputAspectRatio" = "Kuvasuhde.";"inputCenter" = "Suodatettavan alueen keskipiste x- ja y-koordinaatteina.";"inputRadius" = "Etäisyys tehosteen keskipisteestä.";"inputAngle" = "Kulma.";"inputRefraction" = "Tehosteessa käytettävän materiaalin (kuten lasin) taitekerroin.";"inputWidth" = "Tehosteen leveys.";"inputSharpness" = "Suoritettavan terävöittämisen määrä.";"inputIntensity" = "Tehosteen voimakkuus.";"inputEV" = "Aukkolukujen määrä, jonka kuvaa vaalennetaan tai tummennetaan.";"inputSaturation" = "Kylläisyyden säädön määrä.";"inputColor" = "Väri.";"inputBrightness" = "Kirkkaustaso.";"inputContrast" = "Kontrastitaso.";"inputGradientImage" = "Ympäristökartta, jossa on alfa. Yleensä tämä on kuva, joka sisältää korostuksia ja varjoja.";"inputMaskImage" = "Maskauskuva.";"inputShadingImage" = "Ympäristökartta, jossa on alfa-arvoja. Yleensä tämä on kuva, joka sisältää korostuksia ja varjoja.";"inputTargetImage" = "Siirroksen kohdekuva.";"inputExtent" = "Suorakulmio, joka määrittelee tehosteen laajuuden.";"CIBoxBlur.inputRadius" = "Säde tarkoittaa sumennuksen luomiseen käytettyjen pikseleiden määrää. Mitä suurempi säde, sitä sumeampi lopputulos.";"CIDiscBlur.inputRadius" = "Säde tarkoittaa sumennuksen luomiseen käytettyjen pikseleiden määrää. Mitä suurempi säde, sitä sumeampi lopputulos.";"CIGaussianBlur.inputRadius" = "Säde tarkoittaa sumennuksen luomiseen käytettyjen pikseleiden määrää. Mitä suurempi säde, sitä sumeampi lopputulos.";"CIMotionBlur.inputRadius" ="Säde tarkoittaa sumennuksen luomiseen käytettyjen pikseleiden määrää. Mitä suurempi säde, sitä sumeampi lopputulos.";"CIMotionBlur.inputAngle" = "Liikkeen kulma määrittelee suunnan, johon sumennus suttaa.";"CINoiseReduction.inputNoiseLevel" = "Kohinan vähennyksen määrä. Mitä suurempi arvo, sitä enemmän kohinaa vähennetään.";"CINoiseReduction.inputSharpness" = "Lopullisen kuvan terävyys. Mitä suurempi arvo, sitä terävämpi lopputulos.";"CIZoomBlur.inputCenter" = "Tehosteen keskipisteen x- ja y-sijainti.";"CIZoomBlur.inputAmount" = "Lähennyksen määrä. Suuremmat arvot saavat aikaan enemmän lähennystä.";"CIColorControls.inputSaturation" = "Käytettävän kylläisyyden määrä. Mitä suurempi arvo, sitä kylläisempi lopputulos.";"CIColorControls.inputBrightness" = "Käytettävän kirkkauden määrä. Mitä suurempi arvo, sitä kirkkaampi lopputulos.";"CIColorControls.inputContrast" = "Käytettävän kontrastin määrä. Mitä suurempi arvo, sitä enemmän kontrastia tuloksena olevassa kuvassa.";"CIColorMatrix.inputRVector" = "Punaisen määrä, jolla lähdeväriarvot kerrotaan.";"CIColorMatrix.inputGVector" = "Vihreän määrä, jolla lähdeväriarvot kerrotaan.";"CIColorMatrix.inputBVector" = "Sinisen määrä, jolla lähdeväriarvot kerrotaan.";"CIColorMatrix.inputAVector" = "Alfan määrä, jolla lähdeväriarvot kerrotaan.";"CIColorMatrix.inputBiasVector" = "Jokaiseen värikomponenttiin lisättävä vektori.";"CIExposureAdjust.inputEV" = "Kuvan valotuksen säädön määrä. Mitä suurempi arvo, sitä kirkkaampi valotus.";"CIGammaAdjust.inputPower" = "Kuvan kirkkauden korjaamiseen käytettävä gamma-arvo. Mitä suurempi arvo, sitä tummempi lopputulos.";"CIHueAdjust.inputAngle" = "Kuvan sävyn korjaamiseen käytettävä kulma (asteissa).";"CIWhitePointAdjust.inputColor" = "Valkoisena pisteenä käytettävä väri.";"CIColorCube.inputDimension" = "Väritaulukon ulottuvuus.";"CIColorCube.inputCubeData" = "Tämä on ennaltakerrottua alfaa käyttävien liukuluku-RGBA-solujen väritaulukko. Solut on organisoitu standardiin järjestykseen. Datan sarakkeet on indeksoitu punaisella ja rivit vihreällä. Datan toisiaan seuraavat tasot on indeksoitu sinisellä.";"CIColorMap.inputGradientImage" = "Tämän kuvan kuvadata muuntaa lähdekuvan arvot.";"CIColorMonochrome.inputColor" = "Kuvassa käytettävä monokromaattinen väri.";"CIColorMonochrome.inputIntensity" = "Monokromaattisuustehosteen voimakkuus. Arvo 1,0 luo monokromaattisen kuvan määrättyä väriä käyttäen. Arvolla 0,0 ei ole vaikutusta kuvaan.";"CIColorPosterize.inputLevels" = "Värikomponenteissa käytettävien kirkkaustasojen määrä. Pienemmät arvot saavat aikaan voimakkaamman porrastustehosteen.";"CIFalseColor.inputColor0" = "Väriliu'un ensimmäinen väri.";"CIFalseColor.inputColor1" = "Väriliu'un toinen väri.";"CISepiaTone.inputIntensity" = "Seepiatehosteen voimakkuus. Arvo 1,0 luo monokromaattisen seepiakuvan. Arvolla 0,0 ei ole vaikutusta kuvaan.";"CIBumpDistortion.inputCenter" = "Kuplan keskipisteen x- ja y-sijainti."; "CIBumpDistortion.inputRadius" = "Säde tarkoittaa vääristymän luomiseen käytettyjen pikseleiden määrää. Mitä suurempi säde, sitä laajempi vääristymä."; "CIBumpDistortion.inputScale" = "Tehosteen määrä määrittelee kuplan kaarevuuden. Arvolla 0,0 ei ole vaikutusta. Positiiviset arvot luovat ulospäin suuntautuvan kuplan; negatiiviset arvot luovat sisäänpäin suuntautuvan kuplan."; "CIBumpDistortionLinear.inputCenter" = "Vääristymän keskipisteen x- ja y-sijainti."; "CIBumpDistortionLinear.inputRadius" = "Säde tarkoittaa vääristymän luomiseen käytettyjen pikseleiden määrää. Mitä suurempi säde, sitä laajempi vääristymä.";  "CIBumpDistortionLinear.inputScale" = "Tehosteen määrä."; "CIBumpDistortionLinear.inputAngle" = "Viivan, jonka ympärillä vääristymä tapahtuu, kulma (asteissa)."; "CICircleSplashDistortion.inputCenter" = "Vääristymän keskipisteen x- ja y-sijainti.";  "CICircleSplashDistortion.inputRadius" = "Säde tarkoittaa vääristymän luomiseen käytettyjen pikseleiden määrää. Mitä suurempi säde, sitä laajempi vääristymä.";  "CICircularWrap.inputCenter" = "Vääristymän keskipisteen x- ja y-sijainti.";  "CICircularWrap.inputRadius" = "Säde tarkoittaa vääristymän luomiseen käytettyjen pikseleiden määrää. Mitä suurempi säde, sitä laajempi vääristymä.";  "CICircularWrap.inputAngle" = "Tehosteen kulma."; "CIDisplacementDistortion.inputDisplacementImage" = "Kuva, jonka harmaasävyarvoja käytetään lähdekuvassa."; "CIDisplacementDistortion.inputScale" = "Tuloksena olevan kuvan pintakuvioinnin määrä. Mitä suurempi arvo, sitä enemmän pintakuviointia."; "CIGlassDistortion.inputTexture" = "Lähdekuvassa käytettävä pintakuvio.";"CIGlassDistortion.inputCenter" = "Vääristymän keskipisteen x- ja y-sijainti."; "CIGlassDistortion.inputScale" = "Tuloksena olevan kuvan pintakuvioinnin määrä. Mitä suurempi arvo, sitä enemmän pintakuviointia."; "CIGlassLozenge.inputPoint0" = "X- ja y-sijainti, joka määrittelee ympyrän keskipisteen vinoneliön yhdessä päässä."; "CIGlassLozenge.inputPoint1" = "X- ja y-sijainti, joka määrittelee ympyrän keskipisteen vinoneliön toisessa päässä.";  "CIGlassLozenge.inputRadius" = "Vinoneliön säde. Mitä suurempi säde, sitä enemmän vääristymää.";  "CIGlassLozenge.inputRefraction" = "Lasin taittokerroin."; "CIHoleDistortion.inputCenter" = "Vääristymän keskipisteen x- ja y-sijainti.";  "CIHoleDistortion.inputRadius" = "Säde tarkoittaa vääristymän luomiseen käytettyjen pikseleiden määrää. Mitä suurempi säde, sitä laajempi vääristymä.";  "CIPinchDistortion.inputCenter" = "Vääristymän keskipisteen x- ja y-sijainti."; "CIPinchDistortion.inputRadius" = "Säde tarkoittaa vääristymän luomiseen käytettyjen pikseleiden määrää. Mitä suurempi säde, sitä laajempi vääristymä."; "CIPinchDistortion.inputScale" = "Kuopalle painumisen määrä. Arvolla 0,0 ei ole vaikutusta. Arvo 1,0 tarkoittaa suurinta mahdollista kuopalle painumista.";"CITorusLensDistortion.inputCenter" = "Renkaan keskipisteen x- ja y-sijainti.";  "CITorusLensDistortion.inputRadius" = "Renkaan ulkosäde.";  "CITorusLensDistortion.inputWidth" = "Renkaan leveys."; "CITorusLensDistortion.inputRefraction" = "Lasin taittokerroin."; "CITwirlDistortion.inputCenter" = "Vääristymän keskipisteen x- ja y-sijainti.";  "CITwirlDistortion.inputRadius" = "Säde tarkoittaa vääristymän luomiseen käytettyjen pikseleiden määrää. Mitä suurempi säde, sitä laajempi vääristymä."; "CITwirlDistortion.inputAngle" = "Pyörähdyksen kulma (asteissa). Arvot voivat olla positiivisia tai negatiivisia.";"CIVortexDistortion.inputCenter" = "Vääristymän keskipisteen x- ja y-sijainti."; "CIVortexDistortion.inputRadius" = "Säde tarkoittaa vääristymän luomiseen käytettyjen pikseleiden määrää. Mitä suurempi säde, sitä laajempi vääristymä."; "CIVortexDistortion.inputAngle" = "Pyörteen kulma (asteissa).";"CICheckerboardGenerator.inputColor0" = "Ensimmäinen shakkilaudan ruutujen väri.";"CICheckerboardGenerator.inputColor1" = "Toinen shakkilaudan ruutujen väri.";"CICheckerboardGenerator.inputWidth" = "Shakkilautakuvion neliön leveys.";"CICheckerboardGenerator.inputSharpness" = "Shakkilautakuvion terävyys. Mitä pienempi arvo, sitä sumeampi kuvio. Arvot ovat väliltä 0,0 - 1,0.";"CIConstantColorGenerator.inputColor" = "Luotava väri."; "CILenticularHaloGenerator.inputCenter" = "Sädekehän keskipisteen x- ja y-sijainti.";"CILenticularHaloGenerator.inputHaloRadius" = "Sädekehän säde.";"CILenticularHaloGenerator.inputHaloWidth" = "Sädekehän leveys sisäsäteestä ulkosäteeseen.";"CILenticularHaloGenerator.inputOverlap" = "Sädekehän taipumiskomponenttien päällekkäisyyden määrä. Arvo 1,0 tarkoittaa täydellistä päällekkäisyyttä ja tuloksena on valkoinen sädekehä. Arvo 0,0 tarkoittaa täydellistä erillisyyttä ja sädekehän värit eivät ole lainkaan päällekkäin.";"CILenticularHaloGenerator.inputStriationStrength" = "Sädekehän värien voimakkuus. Suuremmat arvot tarkoittavat suurempaa voimakkuutta.";"CILenticularHaloGenerator.inputStriationContrast" = "Sädekehän värien kontrasti. Suuremmat arvot tarkoittavat suurempaa kontrastia.";"CIStarShineGenerator.inputCenter" = "Tähden keskipisteen x- ja y-sijainti."; "CIStarShineGenerator.inputColor" = "Ympyränmuotoisen tähden ulkoreunan väri."; "CIStarShineGenerator.inputRadius" = "Tähden säde."; "CIStarShineGenerator.inputCrossScale" = "Ristikuvion koko."; "CIStarShineGenerator.inputCrossAngle" = "Ristikuvion kulma."; "CIStarShineGenerator.inputCrossOpacity" = "Ristikuvion peittävyys."; "CIStarShineGenerator.inputCrossWidth" = "Ristikuvion leveys."; "CIStarShineGenerator.inputEpsilon" = "Ristipiikkien pituus."; "CIStripesGenerator.inputCenter" = "Juovakuvion keskipisteen x- ja y-sijainti."; "CIStripesGenerator.inputColor0" = "Parittomien juovien väri."; "CIStripesGenerator.inputColor1" = "Parillisten juovien väri.";"CIStripesGenerator.inputWidth" = "Juovan leveys."; "CIStripesGenerator.inputSharpness" = "Juovakuvion terävyys. Mitä pienempi arvo, sitä sumeampi kuvio. Arvot ovat väliltä 0,0 - 1,0."; "CISunbeamsGenerator.inputCenter" = "Auringonsädekuvion keskipisteen x- ja y-sijainti.";"CISunbeamsGenerator.inputColor" = "Auringon väri.";"CISunbeamsGenerator.inputSunRadius" = "Auringon säde.";"CISunbeamsGenerator.inputMaxStriationRadius" = "Auringonsäteiden säde.";"CISunbeamsGenerator.inputStriationStrength" = "Auringonsäteiden voimakkuus. Suuremmat arvot tuottavat enemmän voimakkuutta.";"CISunbeamsGenerator.inputStriationContrast" = "Auringonsäteiden kontrasti. Suuremmat arvot tuottavat enemmän kontrastia.";"CIAffineTransform.inputTransform" = "Kuvassa käytettävä muunnos."; "CICrop.inputRectangle" = "Nelikulmio, joka määrittelee kuvan rajauksen."; "CILanczosScaleTransform.inputScale" = "Kuvassa käytettävä skaalauskerroin. Arvoa 1,0 pienemmät arvot pienentävät kuvaa. Arvoa 1,0 suuremmat arvot suurentavat kuvaa."; "CILanczosScaleTransform.inputAspectRatio" = "Kuvan kuvasuhde."; "CIPerspectiveTransform.inputTopLeft" = "Vasen yläkoordinaatti, johon kuva kuvataan."; "CIPerspectiveTransform.inputTopRight" = "Oikea yläkoordinaatti, johon kuva kuvataan."; "CIPerspectiveTransform.inputBottomRight" = "Oikea alakoordinaatti, johon kuva kuvataan."; "CIPerspectiveTransform.inputBottomLeft" = "Vasen alakoordinaatti, johon kuva kuvataan."; "CIGaussianGradient.inputColor0" = "Väriliu'un ensimmäinen väri."; "CIGaussianGradient.inputColor1" = "Väriliu'un toinen väri."; "CIGaussianGradient.inputRadius" = "Normaalijakauman säde."; "CILinearGradient.inputPoint0" = "Väriliu'un alkusijainti, mistä ensimmäinen väri alkaa."; "CILinearGradient.inputPoint1" = "Väriliu'un loppusijainti, mistä toinen väri alkaa."; "CILinearGradient.inputColor0" = "Väriliu'un ensimmäinen väri.";  "CILinearGradient.inputColor1" = "Väriliu'un toinen väri.";  "CIRadialGradient.inputRadius0" = "Väriliu'ussa käytettävän alkuympyrän säde.";"CIRadialGradient.inputRadius1" = "Väriliu'ussa käytettävän loppuympyrän säde.";"CIRadialGradient.inputColor0" = "Väriliu'un ensimmäinen väri.";  "CIRadialGradient.inputColor1" = "Väriliu'un toinen väri."; "CICircularScreen.inputCenter" = "Ympyränmuotoisen näyttökuvion keskipisteen x- ja y-sijainti."; "CICircularScreen.inputWidth" = "Kuvion ympyröiden välinen etäisyys."; "CICircularScreen.inputSharpness" = "Ympyröiden terävyys. Mitä suurempi arvo, sitä terävämpiä ympyröitä."; "CICMYKHalftone.inputCenter" = "Rasterikuvion keskipisteen x- ja y-sijainti.";  "CICMYKHalftone.inputWidth" = "Kuvion pisteiden välinen etäisyys."; "CICMYKHalftone.inputAngle" = "Kuvion kulma."; "CICMYKHalftone.inputSharpness" = "Kuvion terävyys. Mitä suurempi arvo, sitä terävämpi kuvio."; "CICMYKHalftone.inputGCR" = "Harmaan komponentin korvaava arvo. Arvo voi olla väliltä 0,0 (ei mitään) - 1,0."; "CICMYKHalftone.inputUCR" = "Alivärin poistoarvo. Arvo voi olla väliltä 0,0 - 1,0. "; "CIDotScreen.inputCenter" = "Pistemäisen näyttökuvion keskipisteen x- ja y-sijainti.";  "CIDotScreen.inputAngle" = "Kuvion kulma."; "CIDotScreen.inputWidth" = "Kuvion pisteiden välinen etäisyys."; "CIDotScreen.inputSharpness" = "Kuvion terävyys. Mitä suurempi arvo, sitä terävämpi kuvio."; "CIHatchedScreen.inputCenter" = "Raidoitetun näyttökuvion keskipisteen x- ja y-sijainti."; "CIHatchedScreen.inputAngle" = "Kuvion kulma.";"CIHatchedScreen.inputWidth" = "Kuvion viivojen välinen etäisyys."; "CIHatchedScreen.inputShaprness" = "Kuvion terävyys. Mitä suurempi arvo, sitä terävämpi kuvio."; "CILineScreen.inputCenter" = "Viivanäyttökuvion keskipisteen x- ja y-sijainti.";  "CILineScreen.inputAngle" = "Kuvion kulma."; "CILineScreen.inputWidth" = "Kuvion viivojen välinen etäisyys."; "CILineScreen.inputSharpness" = "Kuvion terävyys. Mitä suurempi arvo, sitä terävämpi kuvio."; 	"CISharpenLuminance.inputSharpness" = "Käytettävän terävyyden määrä. Suuremmat arvot ovat terävämpiä.";"CIUnsharpMask.inputRadius" = "Säde määritellyn pikselin ympärillä, johon käytetään epäterävää maskausta. Mitä suurempi säde, sitä suurempaan osaan kuvaa tehoste vaikuttaa.";"CIUnsharpMask.inputIntensity" = "Tehosteen voimakkuus. Mitä suurempi arvo, sitä enemmän kontrastia kohteena olevalla alueella.";"CIBlendWithMask.inputMaskImage" = "Harmaasävymaski. Kun maskin arvo on 0,0, tuloksena on tausta. Kun maskin arvo on 1,0, tuloksena on kuva."; "CIBloom.inputRadius" = "Säde tarkoittaa tehosteen luomiseen käytettyjen pikseleiden määrää. Mitä suurempi säde, sitä suurempi tehoste.";"CIBloom.inputIntensity" = "Tehosteen voimakkuus. Arvolla 0,0 ei ole vaikutusta. Arvo 1,0 tarkoittaa suurinta mahdollista tehostetta."; "CICrystallize.inputRadius" = "Säde tarkoittaa tehosteen luomiseen käytettyjen pikseleiden määrää. Mitä suurempi säde, sitä suurempia kiteitä tuloksena."; "CIEdges.inputIntensity" = "Reunojen voimakkuus. Mitä suurempi arvo, sitä suurempi voimakkuus."; "CIEdgeWork.inputRadius" = "Reunojen paksuus. Mitä suurempi arvo, sitä paksummat reunat."; "CIGloom.inputRadius" = "Säde tarkoittaa tehosteen luomiseen käytettyjen pikseleiden määrää. Mitä suurempi säde, sitä suurempi tehoste."; "CIGloom.inputIntensity" = "Tehosteen voimakkuus. Arvolla 0,0 ei ole vaikutusta. Arvo 1,0 tarkoittaa suurinta mahdollista tehostetta."; "CIHeightFieldFromMask.inputImage" = "Maskin valkoiset arvot määrittelevät pikselit, jotka ovat korkeuskentän sisäpuolella, ja mustat arvot määrittelevät pikselit, jotka ovat ulkopuolella. Kenttä vaihtuu pehmeästi ja jatkuvasti maskin sisällä ja saavuttaa arvon 0 maskin reunalla."; "CIHeightFieldFromMask.inputRadius" = "Pehmeässä siirroksessa etäisyys maskin reunalta on verrannollinen syötteen säteeseen. Suuremmat arvot tekevät siirroksesta pehmeämmän ja näkyvämmän. Pienemmät arvot saavat siirroksen lähestymään pyöristyssädettä."; "CIHexagonalPixellate.inputCenter" = "Tehosteen keskipisteen x- ja y-sijainti."; "CIHexagonalPixellate.inputScale" = "Määrä määrittelee kuusikulmion koon. Suuremmat arvot tuottavat suurempia kuusikulmioita."; "CILineOverlay.inputNRNoiseLevel" = "Kohinan määrä (käytetään kameradatan kanssa), joka poistetaan ennen kuvan reunojen jäljittämistä. Kohinan määrän lisääminen auttaa puhdistamaan kuvan jäljitettyjä reunoja."; "CILineOverlay.inputNRSharpness" = "Terävöittämisen määrä, joka tehdään kuvan kohinaa poistettaessa ja ennen kuvan reunojen jäljittämistä. Tämä helpottaa reunojen löytämistä."; "CILineOverlay.inputEdgeIntensity" = "Sobel-väriliukutiedon terävöittämiskerroin, jota käytetään kuvan reunoja jäljitettäessä. Suuremmat arvot löytävät enemmän reunoja, mutta yleensä käytetään pientä arvoa (kuten 1,0)."; "CILineOverlay.inputThreshold" = "Tämä arvo määrittelee reunan näkyvyyden. Suuremmat arvot ohentavat reunoja."; "CILineOverlay.inputContrast" = "Tämän suotimen tuottamilla reunoilla käytettävän antialiasoinnin määrä. Suuremmat arvot tuottavat enemmän kontrastia reunoille (ovat vähemmän antialiasoituja)."; "CIPixellate.inputCenter" = "Tehosteen keskipisteen x- ja y-sijainti.";  "CIPixellate.inputScale" = "Määrä määrittelee neliöiden koon. Suuremmat arvot tuottavat suurempia neliöitä."; "CIPointillize.inputRadius" = "Tuloksena olevassa kuviossa olevien ympyröiden säde."; "CIPointillize.inputCenter" = "Tehosteen keskipisteen x- ja y-sijainti.";  "CIShadedMaterial.inputShadingImage" = "Korkeuskenttänä käytettävä kuva. Tuloksena olevassa kuvassa on suuremmat korkeudet vaaleammissa sävyissä ja pienemmän korkeudet (matalammat alueet) tummemmissa sävyissä."; "CIShadedMaterial.inputScale" = "Tehosteen määrä. Mitä suurempi arvo, sitä voimakkaampi tehoste."; "CISpotColor.inputCenterColor1" = "Ensimmäisen korvattavan värialueen keskimmäinen arvo."; "CISpotColor.inputReplacementColor1" = "Ensimmäisen värialueen korvaava väri."; "CISpotColor.inputCloseness1" = "Arvo, joka osoittaa, kuinka lähellä ensimmäisen värin on oltava, jotta se korvataan."; "CISpotColor.inputContrast1" = "Ensimmäisen korvaavan värin kontrasti."; "CISpotColor.inputCenterColor2" = "Toisen korvattavan värialueen keskimmäinen arvo."; "CISpotColor.inputReplacementColor2" = "Toisen värialueen korvaava väri.";"CISpotColor.inputCloseness2" = "Arvo, joka osoittaa, kuinka lähellä toisen värin on oltava, jotta se korvataan."; "CISpotColor.inputContrast2" = "Toisen korvaavan värin kontrasti."; "CISpotColor.inputCenterColor3" = "Kolmannen korvattavan värialueen keskimmäinen arvo.";  "CISpotColor.inputReplacementColor3" = "Kolmannen värialueen korvaava väri."; "CISpotColor.inputCloseness3" = "Arvo, joka osoittaa, kuinka lähellä kolmannen värin on oltava, jotta se korvataan.";  "CISpotColor.inputContrast3" = "Kolmannen korvaavan värin kontrasti.";  "CISpotLight.inputLightPosition" = "Kohdevalon x- ja y-sijainti."; 		"CISpotLight.inputLightPointsAt" = "X- ja y-sijainti, johon kohdevalo osoittaa.";  "CISpotLight.inputBrightness" = "Kohdevalon kirkkaus."; "CISpotLight.inputConcentration" = "Kohdevalon koko. Mitä pienempi arvo, sitä tiiviimpi valonsäde."; "CISpotLight.inputColor" = "Kohdevalon väri."; "CIAffineClamp.inputTransform" = "Kuvassa käytettävä muunnos."; "CIAffineTile.inputTransform" = "Kuvassa käytettävä muunnos."; "CIEightfoldReflectedTile.inputCenter" = "Tehosteen keskipisteen x- ja y-sijainti.";  "CIEightfoldReflectedTile.inputAngle" = "Tiilikuvion kulma (asteissa)."; "CIEightfoldReflectedTile.inputWidth" = "Tiilen leveys."; "CIFourfoldReflectedTile.inputCenter" = "Tehosteen keskipisteen x- ja y-sijainti.";  "CIFourfoldReflectedTile.inputAngle" = "Tiilikuvion kulma (asteissa).";  "CIFourfoldReflectedTile.inputAcuteAngle" = "Toistuvan heijastuneen tiilen ensisijainen kulma. Pienet arvot luovat ohuita timanttitiiliä ja suuremmat arvot leveämpiä heijastuneita tiiliä."; "CIFourfoldReflectedTile.inputWidth" = "Tiilen leveys.";  "CIFourfoldRotatedTile.inputCenter" = "Tehosteen keskipisteen x- ja y-sijainti.";  "CIFourfoldRotatedTile.inputAngle" = "Tiilikuvion kulma (asteissa).";  "CIFourfoldRotatedTile.inputWidth" = "Tiilen leveys."; "CIFourfoldTranslatedTile.inputCenter" = "Tehosteen keskipisteen x- ja y-sijainti.";  "CIFourfoldTranslatedTile.inputAngle" = "Tiilikuvion kulma (asteissa).";  "CIFourfoldTranslatedTile.inputAcuteAngle" = "Toistuvan kääntyneen tiilen ensisijainen kulma. Pienet arvot luovat ohuita timanttitiiliä ja suuremmat arvot leveämpiä heijastuneita tiiliä."; "CIFourfoldTranslatedTile.inputWidth" = "Tiilen leveys.";  "CIGlideReflectedTile.inputCenter" = "Tehosteen keskipisteen x- ja y-sijainti.";  "CIGlideReflectedTile.inputAngle" = "Tiilikuvion kulma (asteissa).";  "CIGlideReflectedTile.inputWidth" = "Tiilen leveys.";  "CIKaleidoscope.inputCount" = "Kuviossa olevien heijastusten määrä."; "CIKaleidoscope.inputCenter" = "Tehosteen keskipisteen x- ja y-sijainti.";  "CIKaleidoscope.inputAngle" = "Heijastuksen kulma."; "CIOpTile.inputCenter" = "Tehosteen keskipisteen x- ja y-sijainti.";  "CIOpTile.inputScale" = "Määrä määrittelee tehosteessa olevien tiilien lukumäärän."; "CIOpTile.inputAngle" = "Tiilen kulma."; "CIOpTile.inputWidth" = "Tiilen leveys."; "CIParallelogramTile.inputCenter" = "Tehosteen keskipisteen x- ja y-sijainti."; "CIParallelogramTile.inputAngle" = "Tiilikuvion kulma (asteissa).";  "CIParallelogramTile.inputAcuteAngle" = "Toistuvan suunnikkaanmuotoisen tiilen ensisijainen kulma. Pienet arvot luovat ohuita timanttitiiliä ja suuremmat arvot leveämpiä suunnikkaanmuotoisia tiiliä."; "CIParallelogramTile.inputWidth" = "Tiilen leveys.";  "CIPerspectiveTile.inputTopLeft" = "Tiilen vasen yläkoordinaatti."; "CIPerspectiveTile.inputTopRight" = "Tiilen oikea yläkoordinaatti.";"CIPerspectiveTile.inputBottomRight" = "Tiilen oikea alakoordinaatti."; "CIPerspectiveTile.inputBottomLeft" = "Tiilen vasen alakoordinaatti."; "CISixfoldReflectedTile.inputCenter" = "Tehosteen keskipisteen x- ja y-sijainti.";  "CISixfoldReflectedTile.inputAngle" = "Tiilikuvion kulma (asteissa).";  "CISixfoldReflectedTile.inputWidth" = "Tiilen leveys."; "CISixfoldRotatedTile.inputCenter" = "Tehosteen keskipisteen x- ja y-sijainti."; "CISixfoldRotatedTile.inputAngle" = "Tiilikuvion kulma (asteissa).";  "CISixfoldRotatedTile.inputWidth" = "Tiilen leveys.";  "CITriangleTile.inputCenter" = "Tehosteen keskipisteen x- ja y-sijainti.";  "CITriangleTile.inputAngle" = "Tiilikuvion kulma (asteissa).";  "CITriangleTile.inputWidth" = "Tiilen leveys.";  "CITwelvefoldReflectedTile.inputCenter" = "Tehosteen keskipisteen x- ja y-sijainti."; "CITwelvefoldReflectedTile.inputAngle" = "Tiilikuvion kulma (asteissa).";"CITwelvefoldReflectedTile.inputWidth" = "Tiilen leveys."; "CIBarsSwipeTransition.inputAngle" = "Palkkien kulma (asteissa).";	"CIBarsSwipeTransition.inputWidth" = "Palkkien leveys.";	"CIBarsSwipeTransition.inputBarOffset" = "Yhden palkin poikkeama toiseen nähden";	"CIBarsSwipeTransition.inputTime" = "Siirroksen parametrinen aika. Tämä arvo ohjaa siirrosta alusta (aika 0) loppuun (aika 1).";"CICopyMachineTransition.inputColor" = "Kopiokoneen valon väri.";"CICopyMachineTransition.inputAngle" = "Kopiokoneen valon kulma.";"CICopyMachineTransition.inputWidth" = "Kopiokoneen valon leveys. ";"CICopyMachineTransition.inputOpacity" = "Kopiokoneen valon peittävyys. Arvo 0,0 tarkoittaa läpinäkyvää. Arvo 1,0 tarkoittaa läpinäkymätöntä.";"CICopyMachineTransition.inputTime" = "Siirroksen parametrinen aika. Tämä arvo ohjaa siirrosta alusta (aika 0) loppuun (aika 1).";"CIDisintegrateWithMaskTransition.inputMaskImage" = "Kuva, joka määrittelee kuvion, jota käytetään hajotettaessa lähdekuva kohdekuvaksi.";"CIDisintegrateWithMaskTransition.inputShadowRadius" = "Maskin luoman varjon säde.";"CIDisintegrateWithMaskTransition.inputShadowDensity" = "Maskin luoman varjon tiheys.";"CIDisintegrateWithMaskTransition.inputShadowOffset" = "Maskin luoman varjon poikkeama.";"CIDisintegrateWithMaskTransition.inputTime" = "Siirroksen parametrinen aika. Tämä arvo ohjaa siirrosta alusta (aika 0) loppuun (aika 1).";"CIDissolveTransition.inputTime" = "Siirroksen parametrinen aika. Tämä arvo ohjaa siirrosta alusta (aika 0) loppuun (aika 1).";"CIFlashTransition.inputCenter" = "Tehosteen keskipisteen x- ja y-sijainti."; "CIFlashTransition.inputExtent" = "Salaman laajuus.";"CIFlashTransition.inputColor" = "Salamasta lähtevien valonsäteiden väri.";"CIFlashTransition.inputMaxStriationRadius" = "Salamasta lähtevien valonsäteiden säde.";"CIFlashTransition.inputStriationStrength" = "Salamasta lähtevien valonsäteiden voimakkuus.";"CIFlashTransition.inputStriationContrast" = "Salamasta lähtevien valonsäteiden kontrasti.";"CIFlashTransition.inputFadeThreshold" = "Salaman ja kohdekuvan välisen häivytyksen määrä. Mitä suurempi arvo, sitä enemmän salama-aikaa ja vähemmän häivytysaikaa.";"CIFlashTransition.inputTime" = "Siirroksen parametrinen aika. Tämä arvo ohjaa siirrosta alusta (aika 0) loppuun (aika 1).";"CIModTransition.inputCenter" = "Tehosteen keskipisteen x- ja y-sijainti."; "CIModTransition.inputAngle" = "Reikäkuvion kulma.";"CIModTransition.inputRadius" = "Kuviossa olevien vääristymättömien reikien säde.";"CIModTransition.inputCompression" = "Reikäkuvioon käytetyn venytyksen määrä. Kuvan keskellä olevia reikiä ei venytetä niin paljon kuin reunoilla olevia.";"CIModTransition.inputTime" = "Siirroksen parametrinen aika. Tämä arvo ohjaa siirrosta alusta (aika 0) loppuun (aika 1).";"CIPageCurlTransition.inputBacksideImage" = "Kuva, joka näkyy lähdekuvan taustalla, kun sivu kääntyy paljastaakseen kohdekuvan.";"CIPageCurlTransition.inputShadingImage" = "Kuva, joka näyttää neliömäiseen kuvaan suljetulta varjostetulta pallolta.";"CIPageCurlTransition.inputExtent" = "Tehosteen laajuus.";"CIPageCurlTransition.inputAngle" = "Kääntyvän sivun kulma.";"CIPageCurlTransition.inputRadius" = "Kääntymisen säde.";"CIPageCurlTransition.inputTime" = "Siirroksen parametrinen aika. Tämä arvo ohjaa siirrosta alusta (aika 0) loppuun (aika 1).";"CIRippleTransition.inputShadingImage" = "Kuva, joka näyttää neliömäiseen kuvaan suljetulta varjostetulta pallolta.";"CIRippleTransition.inputCenter" = "Tehosteen keskipisteen x- ja y-sijainti."; "CIRippleTransition.inputExent" = "Tehosteen laajuus.";"CIRippleTransition.inputWidth" = "Aallon leveys.";"CIRippleTransition.inputScale" = "Arvo, joka määrittelee, alkaako aalto pullistumana (suuri arvo) vai kuoppana (pieni arvo).";"CIRippleTransition.inputTime" = "Siirroksen parametrinen aika. Tämä arvo ohjaa siirrosta alusta (aika 0) loppuun (aika 1).";"CISwipeTransition.inputExtent" = "Tehosteen laajuus.";"CISwipeTransition.inputColor" = "Pyyhkäisyn väri.";"CISwipeTransition.inputAngle" = "Pyyhkäisyn kulma.";"CISwipeTransition.inputWidth" = "Pyyhkäisyn leveys.";"CISwipeTransition.inputOpacity" = "Pyyhkäisyn peittävyys.";"CISwipeTransition.inputTime" = "Siirroksen parametrinen aika. Tämä arvo ohjaa siirrosta alusta (aika 0) loppuun (aika 1).";"CIAreaHistogram" = "Laskee kuvan määritellyn alueen histogrammin ja palauttaa tuloksen 1D-kuvana.";"CIAreaHistogram.inputExtent" = "Suorakulmio, joka määrittelee käsiteltävän osan kuvasta.";"CIAreaHistogram.inputCount" = "Histogrammin luokkien määrä.";"CIAreaHistogram.inputImage" = "Kuva, jonka histogrammi halutaan laskea.";"CIAreaHistogram.inputScale" = "Histogrammin arvoille käytettävä asteikkoarvo.";"CIAreaMaximum" = "Laskee kuvan määritellyn alueen suurimmat komponenttiarvot ja palauttaa tuloksen pikselinä.";"CIAreaMaximum.inputExtent" = "Suorakulmio, joka määrittelee käsiteltävän osan kuvasta.";"CIAreaMaximum.inputImage" = "Käsiteltävä kuva.";"CIAreaMinimum" = "Laskee kuvan määritellyn alueen pienimmät komponenttiarvot ja palauttaa tuloksen pikselinä.";"CIAreaMinimum.inputExtent" = "Suorakulmio, joka määrittelee käsiteltävän osan kuvasta.";"CIAreaMinimum.inputImage" = "Käsiteltävä kuva.";"CIAreaMaximumAlpha" = "Etsii ja palauttaa pikselin, jolla on suurin alfa-arvo.";"CIAreaMaximumAlpha.inputExtent" = "Suorakulmio, joka määrittelee käsiteltävän osan kuvasta.";"CIAreaMaximumAlpha.inputImage" = "Käsiteltävä kuva.";"CIAreaMinimumAlpha" = "Etsii ja palauttaa pikselin, jolla on pienin alfa-arvo.";"CIAreaMinimumAlpha.inputExtent" = "Suorakulmio, joka määrittelee käsiteltävän osan kuvasta.";"CIAreaMinimumAlpha.inputImage" = "Käsiteltävä kuva.";"CIAreaAverage" = "Laskee kuvan määritellyn alueen keskimääräisen värin ja palauttaa tuloksen pikselinä.";"CIAreaAverage.inputExtent" = "Suorakulmio, joka määrittelee käsiteltävän osan kuvasta.";"CIAreaAverage.inputImage" = "Käsiteltävä kuva.";"CIRowAverage" = "Laskee keskimääräisen värin kuvan määritellyn alueen jokaiselle riville ja palauttaa tuloksen 1D-kuvana.";"CIRowAverage.inputExtent" = "Suorakulmio, joka määrittelee käsiteltävän osan kuvasta.";"CIRowAverage.inputImage" = "Käsiteltävä kuva.";"CIColumnAverage" = "Laskee keskimääräisen värin kuvan määritellyn alueen jokaiselle sarakkeelle ja palauttaa tuloksen 1D-kuvana.";"CIColumnAverage.inputExtent" = "Suorakulmio, joka määrittelee käsiteltävän osan kuvasta.";"CIColumnAverage.inputImage" = "Käsiteltävä kuva.";"CIMinimumComponent" = "Muuntaa kuvan harmaasävyiseksi käyttäen kolmen värikomponentin minimiä.";"CIMinimumComponent.inputExtent" = "Suorakulmio, joka määrittelee käsiteltävän osan kuvasta.";"CIMinimumComponent.inputImage" = "Käsiteltävä kuva.";"CIMaximumComponent" = "Muuntaa kuvan harmaasävyiseksi käyttäen kolmen värikomponentin maksimia.";"CIMaximumComponent.inputExtent" = "Suorakulmio, joka määrittelee käsiteltävän osan kuvasta.";"CIMaximumComponent.inputImage" = "Käsiteltävä kuva.";